ci4/ci4/app/Models/AntrianModel.php

SELECT *
FROM `antrian`
JOIN `loket` ON `loket`.`id` = `antrian`.`loket_id`
JOIN `pelayanan` ON `pelayanan`.`id` = `antrian`.`pelayanan_id`
---
  public function getAll($id = false)
  {
    $builder = $this->table('antrian');
    $builder->join('loket', 'loket.id = antrian.loket_id');
    $builder->join('pelayanan', 'pelayanan.id = antrian.pelayanan_id');
    $builder->select('*');
    $query = $builder->get();