ci4/ci4/app/Models/LoketModel.php

  public function index($id = false)
  {
    $builder = $this->table('loket');
    $builder->join('antrian', 'antrian.loket_id = loket.id');
    $builder->join('pelayanan', 'pelayanan.id = loket.pelayanan_id');
    $builder->select('*');
    $query = $builder->get();
---
SELECT *
FROM `loket`
JOIN `antrian` ON `antrian`.`loket_id` = `loket`.`id`
JOIN `pelayanan` ON `pelayanan`.`id` = `loket`.`pelayanan_id`