ci4/ci4/app/Models/PelayananModel.php

  public function noPendaftaran()
  {
    $kode = $this->db->table('pelayanan')
      ->select('RIGHT(kode,2) as kode', false)
      ->orderBy('kode', 'DESC')
      ->limit(1)->get()->getRowArray();
---
SELECT RIGHT(kode, 2) as kode
FROM `pelayanan`
ORDER BY `kode` DESC
 LIMIT 1

  public function id()
  {
    $kode = $this->db->table('pelayanan')
      ->select('RIGHT(id,5) as id', false)
      ->orderBy('id', 'DESC')
      ->limit(1)->get()->getRowArray();
---
SELECT RIGHT(id, 5) as id
FROM `pelayanan`
ORDER BY `id` DESC
 LIMIT 1