ci4/ci4/app/Controllers/Pelayanan.php

INSERT INTO `pelayanan` (`nama`, `kode`) VALUES ('Nia', '08')
INSERT INTO `loket` (`nama`, `pelayanan_id`) VALUES ('Nia', '8')
INSERT INTO `antrian` (`tanggal`, `pelayanan_id`, `loket_id`) VALUES ('2022/07/07 | 11:26', '8', '8')
---
    public function simpan()
    {
        $nama = $this->request->getVar('nama');
        $kode = $this->request->getVar('kode');
        $tanggal = $this->request->getVar('tanggal');
        $pelayanan_id = $this->request->getVar('pelayanan_id');
        $loket_id = $this->request->getVar('pelayanan_id');
        $id = $this->request->getVar('id');
        $data = [
            'nama' => $nama,
            'kode' => $kode,
            'tanggal' => $tanggal,
            'pelayanan_id' => $pelayanan_id,
            'loket_id' => $loket_id
            # menyimpan ke dalam 3 table database
        ];

        $this->PelayananModel->save($data);
        $this->LoketModel->save($data);
        $this->AntrianModel->save($data);